In [5]:
import pandas as pd

In [7]:
df = pd.read_csv("Download files/bonus.csv");
df.head()

  employee_id  performance  years_of_experience  projects_completed  bonus
0     EMP_001            7                    1                   3    116
1     EMP_002            4                    8                  10    136
2     EMP_003            8                    4                   5    150
3     EMP_004            5                    4                   7    118
4     EMP_005            7                    5                   6    146

In [15]:
X = df[df.columns[1:4]]
Y=df[df.columns[-1]]
X.shape

(1000, 3)

In [16]:
from sklearn.model_selection import train_test_split


X_train, X_test, y_train, y_test = train_test_split(X,Y, test_size=0.2, random_state=42)

In [24]:
X_train

     performance  years_of_experience  projects_completed
29             4                    3                   6
535            2                    4                   5
695            7                    3                   5
557            7                    8                   9
836            6                    3                   6
..           ...                  ...                 ...
106            3                    1                   3
270            4                    3                   5
860            2                    9                  12
435            1                    9                  11
102            7                   10                  12

[800 rows x 3 columns]

In [19]:
type(X_train)

pandas.core.frame.DataFrame

In [23]:
X_train.head()
X_train.dtypes[X_train.columns[:]]

performance            int64
years_of_experience    int64
projects_completed     int64
dtype: object

In [20]:
import torch
import torch.nn as nn
import torch.optim as optim

In [ ]:
X_train_tensor = torch.tensor(X_train.to_numpy(), dtype=torch.float32)

y_train_tensor = torch.tensor(y_train.to_numpy(), dtype=torch.float32)

X_test_tensor = torch.tensor(X_test.to_numpy(), dtype=torch.float32)
y_test_tensor = torch.tensor(y_test.to_numpy(), dtype=torch.float32)

X_train_tensor

tensor([[ 4.,  3.,  6.],
        [ 2.,  4.,  5.],
        [ 7.,  3.,  5.],
        ...,
        [ 2.,  9., 12.],
        [ 1.,  9., 11.],
        [ 7., 10., 12.]])